In [1]:
import pandas as pd

In [2]:
cities = {"Kommun": ["Malmö", "Stockholm", "Uppsala", "Göteborg"],
          "Population": [347949, 975551, 233839, 583056]}

In [3]:
df = pd.DataFrame(cities)

In [4]:
df

      Kommun  Population
0      Malmö      347949
1  Stockholm      975551
2    Uppsala      233839
3   Göteborg      583056

In [5]:
filt = df['Kommun'] == 'Göteborg'

In [6]:
filt

0    False
1    False
2    False
3     True
Name: Kommun, dtype: bool

In [7]:
df.sort_values('Population', ascending=False).head(3)

      Kommun  Population
1  Stockholm      975551
3   Göteborg      583056
0      Malmö      347949

In [8]:
sweden_population = 10379295

In [9]:
df['Population (%)'] = (df['Population'] / sweden_population) * 100

In [10]:
df.sort_values('Population', ascending=False)

      Kommun  Population  Population (%)
1  Stockholm      975551        9.399010
3   Göteborg      583056        5.617491
0      Malmö      347949        3.352338
2    Uppsala      233839        2.252937